AUTO_config_TK_pesok/src/Documents/ТК_ПравилаСписанияДопМатериалов/ТК_ПравилаСписанияДопМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_ПравилаСписанияДопМатериалов</name>
  <comment>Правила списания дополнительных материалов при продаже товаров</comment>
  <registerRecords>InformationRegister.ТК_ПравилаСписанияДопМатериалов</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения номенклатурной позиции</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество продукции, которое может быть выпущено с указанными ингредиентами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписанияТМЦ</name>
    <comment>Статья списания ТМЦ на расходы</comment>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопМатериалы</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество списания</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ТК_ПравилаСписанияДопМатериалов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ТК_ПравилаСписанияДопМатериалов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьПравилаСписанияДопМатериалов(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ТК_ПравилаСписанияДопМатериаловПроведениеНаСервере",ВремяНачала,,Строка(Ссылка));
	
КонецПроцедуры



Процедура СообщитьОбОшибках(ТаблицаОшибок,МенеджерВременныхТаблиц)
	
	//Если ТаблицаОшибок.Количество()> 0 Тогда
	//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	НСтр("ru='Перемещение превышает остаток товара компании на складе %1 %2 %3';uk='Переміщення перевищує залишок товару компанії на складі %1 %2 %3'"),
	//	СкладКомпании);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//	ТекстСообщения,
	//	ЭтотОбъект);	
	//	
	//	Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл 
	//		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru='Номенклатура: %1, недостаточно %2 %3';uk='Номенклатура: %1, недостатньо %2 %3'"),
	//		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.ХарактеристикаНоменклатуры),
	//		СтрокаТаблицы.Количество,
	//		СтрокаТаблицы.ЕдиницаИзмерения);
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		ТекстСообщения,
	//		Ссылка);
	//		
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	
КонецПроцедуры



#Область ИнициализацияИЗаполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор =  Пользователи.ТекущийПользователь();
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	ХозОперация = Справочники.ХозОперации.УстановкаПравилаСписанияДопМатериалов;
	Количество = 1;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
КонецПроцедуры // ИнициализироватьДокумент()


#КонецОбласти

	



#КонецЕсли
